{
  "backend/main.mo": "Motoko actor defining all data types (Product, Sale, DeadPlant, Expense, Worker, Customer) and CRUD operations for a nursery management system with in-memory storage using Maps.",
  "feature_evidence.json": "Feature evidence report documenting implemented features for dashboard, plants, pots, propagation plants, and other inventory management screens with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON summary of frontend files including router configuration, utility functions, settings page, PWA components, service worker registration, and styling.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark theme variables including custom nursery theme colors.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest link, and theme color configuration for the Sharath Nursery Farm application.",
  "frontend/public/manifest.json": "PWA manifest defining app name, display mode, theme colors, and icon configurations for standalone mobile installation.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for offline support, caching app shell and assets with cache versioning.",
  "frontend/src/App.tsx": "Main application router using TanStack Router, defining all routes for dashboard, inventory, billing, reports, and settings pages.",
  "frontend/src/components/billing/BillSuccessModal.tsx": "Dialog modal component displaying bill generation success message with print and PDF download action buttons.",
  "frontend/src/components/billing/CartTable.tsx": "Placeholder component for displaying shopping cart items in the billing interface.",
  "frontend/src/components/billing/InventorySearch.tsx": "Placeholder component for searching and selecting inventory items during billing process.",
  "frontend/src/components/billing/PaymentSection.tsx": "Payment section component with bill generation button for completing sales transactions.",
  "frontend/src/components/customers/CustomerDetail.tsx": "Dialog modal component displaying detailed customer information when selected from the customer list.",
  "frontend/src/components/customers/CustomerTable.tsx": "Table component for displaying customer list with loading state and empty state handling.",
  "frontend/src/components/dashboard/RevenueChart.tsx": "Line chart component using Recharts to visualize revenue trends over time with responsive container.",
  "frontend/src/components/deadplants/DeadPlantForm.tsx": "Form component for recording dead or damaged plants with submission functionality.",
  "frontend/src/components/deadplants/DeadPlantTable.tsx": "Table component displaying dead plant records with loading and empty state handling.",
  "frontend/src/components/expenses/ExpenseForm.tsx": "Form component for adding new expense entries to the system.",
  "frontend/src/components/expenses/ExpenseTable.tsx": "Table component displaying expense records with loading and empty state handling.",
  "frontend/src/components/expenses/MonthlySummary.tsx": "Card component displaying monthly expense summary with total amount calculation.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout component with sidebar navigation, mobile menu, header, footer with Caffeine.ai attribution, and toast notifications.",
  "frontend/src/components/layout/MobileNav.tsx": "Mobile navigation sidebar component with overlay backdrop, displaying app navigation links with icons and active state highlighting. Closes on link click or backdrop tap.",
  "frontend/src/components/layout/Sidebar.tsx": "Desktop sidebar component displaying the Sharath Nursery branding and navigation menu with icons. Highlights active routes based on current pathname.",
  "frontend/src/components/plants/PlantForm.tsx": "Form component for adding or editing plant products with fields for name, category, prices, stock quantity, and image. Handles submission via React Query mutations and displays toast notifications.",
  "frontend/src/components/plants/PlantTable.tsx": "Table component displaying plant inventory with columns for name, category, prices, and stock. Includes edit and delete actions with confirmation dialog for deletions.",
  "frontend/src/components/pots/PotForm.tsx": "Form component for adding or editing pot products with fields for name, size, color, type, prices, stock, and image. Uses React Query mutations for data persistence.",
  "frontend/src/components/pots/PotTable.tsx": "Table component displaying pot inventory with columns for name, size/color, type, prices, and stock. Provides edit and delete actions with confirmation dialogs.",
  "frontend/src/components/propagation/PropagationForm.tsx": "Minimal placeholder form component for propagation plants with only a plant name field. Currently shows success toast without actual data persistence.",
  "frontend/src/components/propagation/PropagationTable.tsx": "Placeholder table component for propagation plants that currently only displays loading or empty state messages without actual data rendering.",
  "frontend/src/components/pwa/InstallPrompt.tsx": "React component that displays a dismissible card prompting users to install the PWA, handling the beforeinstallprompt event and triggering the browser's native install dialog.",
  "frontend/src/components/reports/CAGRMetrics.tsx": "Displays two cards showing Revenue CAGR and Profit CAGR metrics, currently hardcoded to 0%.",
  "frontend/src/components/reports/CAGRTrendChart.tsx": "Renders a line chart for CAGR trends over years using Recharts, currently displaying empty data.",
  "frontend/src/components/reports/DailySalesChart.tsx": "Bar chart component for displaying daily sales data for a given month using Recharts, currently with empty data.",
  "frontend/src/components/reports/DeadLossImpact.tsx": "Card component placeholder for analyzing the impact of dead plant losses on CAGR.",
  "frontend/src/components/reports/DeadPlantMetrics.tsx": "Displays two metric cards showing total dead plant count and total monetary loss calculated from deadPlants data.",
  "frontend/src/components/reports/DeadPlantTips.tsx": "Card component displaying a static list of tips to reduce plant loss (watering, pest monitoring, drainage).",
  "frontend/src/components/reports/DeathRateTable.tsx": "Placeholder component for displaying death rate analysis table, currently shows centered text.",
  "frontend/src/components/reports/InvestmentBreakdown.tsx": "Card component placeholder for displaying investment breakdown analysis.",
  "frontend/src/components/reports/LossByCategoryChart.tsx": "Bar chart component for visualizing plant losses by category using Recharts, currently with empty data.",
  "frontend/src/components/reports/LossByReasonChart.tsx": "Pie chart component for displaying plant losses grouped by reason using Recharts, currently with empty data.",
  "frontend/src/components/reports/MetricsCards.tsx": "Displays four metric cards calculating and showing revenue, expenses, dead loss, and net profit from sales, expenses, and deadPlants data.",
  "frontend/src/components/reports/MonthlyBreakdownTable.tsx": "Placeholder component for monthly breakdown table, currently shows centered text.",
  "frontend/src/components/reports/MonthlyDeathTrend.tsx": "Line chart component for showing monthly dead plant trends using Recharts, currently with empty data.",
  "frontend/src/components/reports/MonthlyROIChart.tsx": "Line chart component for displaying monthly ROI trends using Recharts, currently with empty data.",
  "frontend/src/components/reports/ROIComparison.tsx": "Card component placeholder for ROI comparison analysis.",
  "frontend/src/components/reports/SmartInsights.tsx": "Displays a destructive alert with an icon prompting users to monitor plant health closely.",
  "frontend/src/components/reports/TopProducts.tsx": "Placeholder component for displaying top products, currently shows 'No sales data' message.",
  "frontend/src/components/reports/YearComparisonChart.tsx": "Line chart component comparing revenue and profit across months for a given year using Recharts, currently with empty data.",
  "frontend/src/components/reports/YoYComparisonTable.tsx": "Placeholder component for year-over-year comparison table, currently shows centered text.",
  "frontend/src/components/reports/YoYGrowth.tsx": "Card component calculating and displaying year-over-year sales growth percentage with trending up/down icon based on comparison of current and previous year sales.",
  "frontend/src/components/settings/BusinessInfoForm.tsx": "Form component for editing business information including name, owner, address, WhatsApp, and Instagram with pre-filled default values for Sharath Nursery Farm.",
  "frontend/src/components/workers/PaymentForm.tsx": "Placeholder component with a 'Record Payment' button for worker payment functionality.",
  "frontend/src/components/workers/WorkerForm.tsx": "Placeholder component with an 'Add Worker' button for adding new workers.",
  "frontend/src/components/workers/WorkerTable.tsx": "Table component for displaying workers list with loading state and empty state message.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor using React Query, handling both authenticated and anonymous actors based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook providing Internet Identity authentication functionality including login, logout, identity management, and authentication status tracking using @dfinity/auth-client.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating nursery data (plants, pots, sales, expenses, workers, customers, dead plants) via the backend actor. Includes query hooks for retrieving data and mutation hooks for adding, updating, and deleting records with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes and nursery-specific color schemes (primary, secondary, accent). Defines utility classes for nursery colors including text, background, border, and hover states.",
  "frontend/src/lib/reportUtils.ts": "Utility functions for generating month and year options for reports, and filtering data arrays by month or year based on bigint timestamps. Provides helpers for date-based data filtering in reporting components.",
  "frontend/src/lib/utils.ts": "Common utility functions including className merging (cn), currency formatting in INR, and date conversion between bigint timestamps and DD/MM/YYYY strings. Provides core formatting and parsing helpers used throughout the application.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component. Configures the provider hierarchy for authentication and data fetching.",
  "frontend/src/pages/Billing.tsx": "Billing/sales page component that displays bill creation interface with inventory search, cart management, and payment processing. Includes customer details toggle and success modal for completed transactions.",
  "frontend/src/pages/CAGRReport.tsx": "CAGR (Compound Annual Growth Rate) report page showing year-over-year financial analysis with metrics, comparison tables, trend charts, and dead plant loss impact. Allows selecting start and end years for analysis period.",
  "frontend/src/pages/Customers.tsx": "Customer management page displaying searchable customer list with purchase history. Includes search by name/phone and detailed customer view modal for viewing individual customer transactions.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page showing key metrics (today's sales, bill count, low stock alerts, dead plants), revenue charts, quick action buttons, and recent activity lists. Provides overview of nursery operations and navigation to other sections.",
  "frontend/src/pages/DeadPlantReport.tsx": "Displays a comprehensive dead plant loss report page with metrics, charts (loss by reason/category, monthly trends), death rate table, smart insights, and tips components.",
  "frontend/src/pages/DeadPlants.tsx": "Dead plant management page with a form to record dead/damaged plants and a table displaying the history of all recorded dead plants.",
  "frontend/src/pages/Expenses.tsx": "Expenses management page featuring a form to add new expenses, an expense history table, and a monthly summary sidebar in a responsive grid layout.",
  "frontend/src/pages/MonthlySalesReport.tsx": "Monthly sales report page with month selector dropdown, displaying metrics cards, daily sales trend chart, and top selling products for the selected month.",
  "frontend/src/pages/Plants.tsx": "Plants inventory page with search and category filtering, displaying a table of plants with add/edit functionality via a dialog modal form.",
  "frontend/src/pages/Pots.tsx": "Pots inventory management page with search functionality, displaying a table of pots with add/edit capabilities through a dialog modal.",
  "frontend/src/pages/PropagationPlants.tsx": "Propagation plants management page with search feature, showing a table of propagated plants with add/edit functionality via dialog modal.",
  "frontend/src/pages/ROIReport.tsx": "ROI (Return on Investment) report page displaying investment breakdown, ROI comparison, and monthly ROI trend chart using data from sales, expenses, products, and dead plants.",
  "frontend/src/pages/Settings.tsx": "Settings page with business information form and data backup functionality that exports all business data (sales, expenses, dead plants, customers, workers) as a JSON file.",
  "frontend/src/pages/Workers.tsx": "Worker management page with forms to add new workers and record salary payments, plus a table displaying all workers and their information.",
  "frontend/src/pages/YearlySalesReport.tsx": "React page component that displays a yearly sales report with year selection dropdown, year-over-year growth metrics, monthly breakdown table, and revenue/profit trend chart using data from sales, expenses, and dead plants queries.",
  "frontend/src/registerServiceWorker.ts": "Registers a service worker for PWA offline functionality by loading '/service-worker.js' when the window loads if the browser supports service workers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color scheme using OKLCH color space (including nursery-specific colors), container settings, border radius variables, animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata file documenting the Sharath Nursery Farm PWA architecture, tech stack (React/Node/MongoDB), color scheme, database collections, business rules (bill format, stock deduction, dead plant loss calculations), and comprehensive list of implemented features for inventory, billing, reporting, and PWA capabilities."
}